china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_uart.c
    __UART_TxIntEnable(s_UART_DmaUsed[port],port);
    return 1;
}

// =============================================================================
// 功能: 设置uart使用dma收发，根据stm32各串口的收发dma通道配置寄存器。将重新初
//       始化所有dma寄存器，因为:
//       1、不使用dma期间可能有其他设备使用dma，从而更改了设置。
//       2、即使uart使用dma期间，也可能软件模块配合的问题导致其他设备使用dma.
// 参数: port,端口号，即串口号，从1~3
// 返回: 无
// =============================================================================
void __UART_SetDmaUsed(u32 port)
{
    u8 *DmaRecvBuf,*DmaSendBuf;
    switch(port)
    {
    case CN_UART1:
        DmaRecvBuf = UART1_DmaRecvBuf;
        DmaSendBuf = UART1_DmaSendBuf;
        break;
    case CN_UART2:
        DmaRecvBuf = UART2_DmaRecvBuf;
        DmaSendBuf = UART2_DmaSendBuf;
        break;
    case CN_UART3:
        DmaRecvBuf = UART3_DmaRecvBuf;
        DmaSendBuf = UART3_DmaSendBuf;
        break;
    case CN_UART4:
        DmaRecvBuf = UART4_DmaRecvBuf;
        DmaSendBuf = UART4_DmaSendBuf;
        break;
    default :        break;
    }
    __UART_RxIntDisable(CN_DMA_UNUSED,port); //串口中断失能
    __UART_TxIntDisable(CN_DMA_UNUSED,port);
    tg_UART_Reg[port]->CR1 |= (1<<4); //enable idle int 串口空闲中断

    DMA_Config(UartDmaRxChannel[port],(u32)&(tg_UART_Reg[port]->RDR),
            (u32)DmaRecvBuf,DMA_DIR_P2M,DMA_DATABITS_8,DMA_DATABITS_8,100);

    DMA_Config(UartDmaTxChannel[port],(u32)&(tg_UART_Reg[port]->TDR),
            (u32)DmaSendBuf,DMA_DIR_M2P,DMA_DATABITS_8,DMA_DATABITS_8,100);

    tg_UART_Reg[port]->CR3 |= 0x00c0;  //设置串口使用dma收发
    s_UART_DmaUsed[port] = CN_DMA_USED;


    Int_Register(UartDmaTxInt[port]);//注册发送DMA中断
    Int_Register(UartDmaRxInt[port]);//注册接收DMA中断

    Int_SetClearType(UartDmaRxInt[port],CN_INT_CLEAR_AUTO);//关联中断
    Int_IsrConnect(UartDmaRxInt[port],UART_DmaRx_ISR);

    Int_SetClearType(UartDmaTxInt[port],CN_INT_CLEAR_AUTO);
    Int_IsrConnect(UartDmaTxInt[port],UART_DmaTx_ISR);

    Int_SettoAsynSignal(UartDmaRxInt[port]);
    Int_SettoAsynSignal(UartDmaTxInt[port]);

    Int_RestoreAsynLine(UartDmaRxInt[port]);
    Int_RestoreAsynLine(UartDmaTxInt[port]);

    Int_ClearLine(UartDmaTxInt[port]);
    Int_ClearLine(UartDmaRxInt[port]);

//    DMA_Enable(UartDmaTxChannel[port],(u32)DmaSendBuf,0);  //启动dma通道发送,自己添加,刚开始不应该发送,此处添加会导致总读到一字节数据
    DMA_Enable(UartDmaRxChannel[port],(u32)DmaRecvBuf,100);//启动dma通道接收
}

//=============================================================================
// 功能: 设置不使用DMA，UART不使用DMA收发，每收发一个字节就必须中断一次，不建议在高速
//      连续通信中使用。
// 参数: port,端口号，即串口号，为1~3
// 返回: 无
// =============================================================================
void __UART_SetDmaUnUsed(u32 port)
{
    u8 IntLine;
    if(port == CN_UART1)             IntLine = CN_INT_LINE_USART1;
    else if(port == CN_UART2)        IntLine = CN_INT_LINE_USART2;
    else if(port == CN_UART3)        IntLine = CN_INT_LINE_USART3;
    else if(port == CN_UART4)        IntLine = CN_INT_LINE_UART4;
    else if(port == CN_UART5)        IntLine = CN_INT_LINE_UART5;
    else
    return;

    tg_UART_Reg[port]->CR3 &= ~0x00c0;  //设置不使用dma传输
    Int_RestoreAsynLine(IntLine);
    if(s_UART_DmaUsed[port] == CN_DMA_USED)
    {
        Int_SaveAsynLine(UartDmaRxInt[port]);
        Int_SaveAsynLine(UartDmaTxInt[port]);
        s_UART_DmaUsed[port] = CN_DMA_UNUSED;
    }
    __UART_RxIntEnable(CN_DMA_USED,port);
    __UART_TxIntEnable(CN_DMA_USED,port);
    tg_UART_Reg[port]->CR1 &= ~(1<<4); //disable idle int
}
// =============================================================================
// 功能: 串口设备的控制函数,与具体的硬件寄存器设置相关
// 参数: Reg,被操作的串口寄存器指针.
//       cmd,操作类型
//       data1,data2,含义依cmd而定
// 返回: 无意义.
// =============================================================================
static ptu32_t __UART_Ctrl(tagUartReg *Reg,u32 cmd, u32 data1,u32 data2)
{
    ptu32_t result = 0;
    u32 port;
    u32 timeout = 10000;
    if(Reg == NULL)
        return 0;

    switch((u32)Reg)
    {
    case CN_UART1_BASE: port = CN_UART1;break;
    case CN_UART2_BASE: port = CN_UART2;break;
    case CN_UART3_BASE: port = CN_UART3;break;
    case CN_UART4_BASE: port = CN_UART4;break;
    case CN_UART5_BASE: port = CN_UART5;break;
    default:return 0;
    }

    switch(cmd)
    {
        case CN_UART_START:
            __UART_Enable(port);
            break;
        case CN_UART_STOP:
            __UART_Disable(port);
            break;
        case CN_UART_HALF_DUPLEX_SEND: //发送数据
            Board_UartHalfDuplexSend(port);
            break;

        case CN_UART_HALF_DUPLEX_RECV: //接收数据
            while((false == __UART_TxTranEmpty(Reg))&& (timeout > 10))
            {
                timeout -=10;
                Djy_DelayUs(10);
            }
            Board_UartHalfDuplexRecv(port);
            break;

        case CN_UART_SET_BAUD:  //设置Baud
             __UART_BaudSet(Reg,port, data1);
            break;
        case CN_UART_EN_RTS:
            Reg->CR3 |= 0x100;
            break;
        case CN_UART_DIS_RTS:
            Reg->CR3 &= ~0x100;
            break;
        case CN_UART_EN_CTS:
            Reg->CR3 |= 0x200;
            break;
        case CN_UART_DIS_CTS:
            Reg->CR3 &= ~0x200;
            break;
        case CN_UART_DMA_USED:
            __UART_SetDmaUsed(port);
            break;
        case CN_UART_DMA_UNUSED:
            __UART_SetDmaUnUsed(port);
            break;
        case CN_UART_COM_SET:
            __UART_ComConfig(Reg,port,data1);
            break;
        default: break;
    }
    return result;
}

// =============================================================================
// 功能: 当uart2配置成dma方式是，dma1 ch7负责发送，ch6负责接收
// 参数: 中断函数没有参数.
// 返回: 中断函数没有返回值.
// =============================================================================
uint32_t UART_DmaTx_ISR(ptu32_t tagIntLine)
{
    uint16_t num,port;
    u8 *DmaSendBuf;
    u32 DmaSendBufLen;

    for(port = CN_UART1; port <= CN_UART5;port++)
    {
        if(tagIntLine == UartDmaTxInt[port])
            break;
    }
    switch(port)
    {
    case CN_UART1:
        DmaSendBuf = UART1_DmaSendBuf;
        DmaSendBufLen = UART1_DmaBufLen;
        break;
    case CN_UART2:
        DmaSendBuf = UART2_DmaSendBuf;
        DmaSendBufLen = UART2_DmaBufLen;
        break;
    case CN_UART3:
        DmaSendBuf = UART3_DmaSendBuf;
        DmaSendBufLen = UART3_DmaBufLen;
        break;
    case CN_UART4:
        DmaSendBuf = UART4_DmaSendBuf;
        DmaSendBufLen = UART4_DmaBufLen;
        break;
    default:
        break;
    }

    DMA_ClearIntFlag(UartDmaTxChannel[port]);
    num = UART_PortRead(pUartCB[port],DmaSendBuf,DmaSendBufLen,0);
    if(num == 0)
    {
        s_UART_DmaSending[port] = false;
    }
    else
    {
        DMA_Enable(UartDmaTxChannel[port],(u32)DmaSendBuf,num);
    }
    return 0;
}

